FEMALE_OUTER_CATEGORY = \
{
    "여성": {
        "아우터": {
            "자켓": [
                "블루종/MA-1",
                "스타디움 재킷 (바시티)",
                "레더/라이더스 재킷",
                "나일론/코치 재킷",
                "데님/트러커 재킷",
                "블레이저",
                "야상",
                "점퍼/집업(에이블리)",
                "후드집업(무신사,29)",
                "점퍼(29)",
                "트레이닝 재킷",
                "아노락 재킷",
                "바람막이",
                "사파리/헌팅 재킷",
                "자켓",
            ],
            "플리스": [
                "플리스/뽀글이",
                "무스탕/퍼 자켓(무신사)",
                "무스탕(29)",
                "퍼 자켓(29)",
                "베스트",
            ],
            "코트": [
                "트렌치 코트",
                "하프코트",
                "롱코트",
                "숏코트",
            ],
            "패딩": [
                "숏패딩",
                "롱패딩",
                "경량패딩",
                "패딩베스트",
            ],
            "기타": [
                "로브",
                "기타 아우터",
            ],
        }
    }
}


FEMALE_SHIRT_CATEGORY = \
{
    "여성": {
        "상의": {
            "티셔츠": [
                "반소매 티셔츠",
                "긴소매 티셔츠",
                "민소매 티셔츠 (29cm 슬리브리스, 에이블리 조끼)",
                "맨투맨/스웨트",
                "후드 티셔츠",
                "피케/카라",
                "폴로",
            ],
            "셔츠": [
                "셔츠/블라우스(무신사)",
                "셔츠(29, 에이블리)",
                "블라우스(29, 에이블리)",
            ],
            "니트": [
                "니트/스웨터",
                "가디건",
                "베스트",
                "터틀넥",
                "브이넥",
                "크루넥",
                "캐시미어",
                "기타 니트",
            ],
        }
    }
}


FEMALE_PANTS_CATEGORY = \
{
    "여성": {
        "하의": {
            "팬츠": [
                "슈트 팬츠/슬랙스",
                "트레이닝",
                "숏 팬츠",
                "레깅스",
                "슬림",
                "스트레이트",
                "와이드",
                "부츠컷",
                "코튼",
                "데님",
                "기타 하의",
            ],
            "원피스": [
                "미니원피스",
                "미디/맥시 원피스",
                "롱 원피스",
                "데님 원피스",
            ],
            "스커트": [
                "미니 스커트",
                "미디 스커트",
                "롱 스커트",
                "미디/롱스커트(에이블리)",
                "데님 스커트",
            ],
        }
    }
}

FEMALE_SHOES_CATEGORY = \
{
    "여성": {
        "신발": {
            "전체": [
                "스니커즈",
                "스포츠화",
                "구두/펌프스",
                "부츠/워커",
                "패딩/퍼",
                "샌들",
                "슬리퍼",
                "뮬/블로퍼",
                "플랫/로퍼",
            ]
        }
    }
}


MALE_OUTER_CATEGORY = \
{
    "남성": {
        "아우터": {
            "재킷": [
                "블루종/MA-1",
                "스타디움 재킷",
                "레더/라이더스 재킷",
                "데님/트러커 재킷",
                "나일론/코치 재킷",
                "후드집업",
                "점퍼(29)",
                "아노락 재킷",
                "바람막이",
                "트레이닝",
                "야상",
                "블레이저",
            ],
            "코트": [
                "트렌치코트",
                "숏코트",
                "하프코트",
                "롱코트",
            ],
            "패딩": [
                "롱패딩",
                "숏패딩",
                "경량패딩",
                "패딩 베스트",
            ],
            "플리스": [
                "플리스/뽀글이",
                "무스탕/퍼 자켓(무신사)",
                "무스탕(29)",
                "퍼 자켓(29)",
                "베스트",
            ],
            "기타": [
                "기타 아우터",
            ],
        },
    }
}

MALE_SHIRT_CATEGORY = \
{
    "남성": {
        "상의": {
            "티셔츠": [
                "반소매 티셔츠",
                "긴소매 티셔츠",
                "민소매 티셔츠",
                "맨투맨/스웨트",
                "후드 티셔츠",
                "피케/카라",
            ],
            "셔츠": [
                "셔츠/블라우스",
                "긴소매 셔츠",
                "반소매 셔츠",
            ],
            "니트": [
                "니트/스웨터",
                "터틀넥",
                "브이넥",
                "크루넥",
                "폴로",
                "집업",
                "카디건",
                "후드",
                "베스트",
            ],
        },
    }
}

MALE_PANTS_CATEGORY = \
{
    "남성":{
        "하의": {
            "팬츠": [
                "슬림 팬츠",
                "스트레이트 팬츠",
                "와이드 팬츠",
                "숏 팬츠",
                "데님",
                "레깅스",
                "부츠컷",
                "트레이닝",
                "슬랙스",
                "기타 하의",
            ],
        },
    }
}

MALE_SHOES_CATEGORY = \
{
    "남성": {
        "신발": {
            "전체": [
                "스니커즈",
                "스포츠화",
                "구두",
                "샌들/슬리퍼",
                "부츠/워커",
                "로퍼",
                "패딩/퍼",
            ],
        },
    }
}

MALE_CATEGORY_LIST = [MALE_OUTER_CATEGORY, MALE_SHIRT_CATEGORY, MALE_PANTS_CATEGORY, MALE_SHOES_CATEGORY]
FEMALE_CATEGORY_LIST = [FEMALE_OUTER_CATEGORY, FEMALE_SHIRT_CATEGORY, FEMALE_PANTS_CATEGORY, FEMALE_SHOES_CATEGORY]

__all__ = ["MALE_CATEGORY_LIST", "FEMALE_CATEGORY_LIST"]
