SEXUAL_CATEGORY_DYNAMIC_PARAMS = [
    {"SEXUAL":{"F":"여성"}, 
     "CATEGORIES":[
        {"shoes": [{
            "전체":
                {"103001":"구두", "103002":"부츠&워커", "103003":"샌들&슬리퍼",
                "103004":"스니커즈", "103005":"스포츠화", "103007":"패딩&퍼 신발"}
        }]},
        {"outer":[{
            "재킷": 
                {"002001":"블루종&MA-1", "002004":"스타디움 재킷", "002002":"레더&라이더스 재킷",
                "002006":"나일론&코치 재킷", "002017":"데님&트러커 재킷", "002022":"후드집업",
                "002018":"트레이닝 재킷", "002019":"아노락 재킷"}
        }, {
            "폴리스": 
                {"002023":"폴리스&뽀글이", "002025":"무스탕&퍼 재킷"}
        }, {
            "코트": 
                {"002007":"겨울 싱글 코트", "002004":"겨울 더블 코트"}
        }, {
            "패딩": 
                {"002012":"숏패딩", "002013":"롱패딩", "002016":"패딩 베스트"}
        }]},
        {"top":[{
           "티셔츠": 
                {"001001":"반소매 티셔츠", "001010":"긴소매 티셔츠", "001011":"민소매 티셔츠",
                "001005":"맨투맨&스웨트", "001004":"후드 티셔츠"} 
        }, {
            "셔츠": 
                {"001002":"셔츠&블라우스"}
        }, {
            "니트": 
                {"001006":"니트&스웨터", "002020":"가디건"}
        }]},
        {"bottom":[{
            "팬츠": 
                {"003008":"슈트 팬츠&슬랙스", "003004":"트레이닝", "003009":"숏팬츠",
                "003005":"레깅스", "003007":"코튼", "003002":"데님",
                "003006":"기타 하의"}
        },{
            "원피스": 
                {"100001":"미니원피스", "100002":"미디원피스", "100003":"맥시원피스"}
        },{
            "스커트": 
                {"100004":"미니스커트", "100005":"미디스커트", "100006":"롱스커트"}
        }]}
    ]},
    {"SEXUAL":{"M":"남성"}, 
     "CATEGORIES":[
        {"shoes":[{
            "전체":
                {"103001":"구두", "103002":"부츠&워커", "103003":"샌들&슬리퍼",
                "103004":"스니커즈", "103005":"스포츠화", "103007":"패딩&퍼 신발"}
        }]},
        {"outer":[{
            "재킷": 
                {"002001":"블루종&MA-1", "002004":"스타디움 재킷", "002002":"레더&라이더스 재킷",
                "002006":"나일론&코치 재킷", "002017":"데님&트러커 재킷", "002022":"후드집업",
                "002018":"트레이닝 재킷", "002019":"아노락 재킷"}
        }, {
            "폴리스": 
                {"002023":"폴리스&뽀글이", "002025":"무스탕&퍼 재킷"}
        }, {
            "코트": 
                {"002008":"트렌치코트","002007":"겨울 싱글 코트", "002004":"겨울 더블 코트"}
        }, {
            "패딩": 
                {"002012":"숏패딩", "002013":"롱패딩", "002016":"패딩 베스트", "002025":"경량패딩"}
        }, {
            "기타":
                {"002015":"기타 아우터"}    
        }]},
        {"top" : [{
           "티셔츠" : 
                {"001001":"반소매 티셔츠", "001010":"긴소매 티셔츠", "001011":"민소매 티셔츠",
                "001005":"맨투맨&스웨트", "001004":"후드 티셔츠"}
        }, {
            "셔츠" : 
                {"001002":"셔츠&블라우스"}
        }, {
            "니트" : 
                {"001006":"니트&스웨터", "002020":"가디건"}
        }]},
        {"bottom" : [{
            "팬츠" : 
                {"003008":"슈트 팬츠&슬랙스", "003004":"트레이닝", "003009":"숏팬츠",
                "003005":"레깅스", "003007":"코튼", "003002":"데님",
                "003006":"기타 하의"}
        }]}
        ]
     }]

CATEGORY2DEPTH_MAPPING = {
    "신발": {
        "전체": ["구두", "부츠&워커", "샌들&슬리퍼", "스니커즈", "스포츠화", "패딩&퍼 신발"]
    },
    "아우터": {
        "재킷": ["블루종&MA-1", "스타디움 재킷", "레더&라이더스 재킷", "나일론&코치 재킷", "데님&트러커 재킷", "후드집업", "트레이닝 재킷", "아노락 재킷"],
        "폴리스": ["폴리스&뽀글이", "무스탕&퍼 재킷"],
        "코트": ["겨울 싱글 코트", "겨울 더블 코트", "트렌치코트"],
        "패딩": ["숏패딩", "롱패딩", "패딩 베스트", "경량패딩"],
        "기타": ["기타 아우터"]
    },
    "상의": {
        "티셔츠": ["반소매 티셔츠", "긴소매 티셔츠", "민소매 티셔츠", "맨투맨&스웨트", "후드 티셔츠"],
        "셔츠": ["셔츠&블라우스"],
        "니트": ["니트&스웨터", "가디건"]
    },
    "하의": {
        "팬츠": ["슈트 팬츠&슬랙스", "트레이닝", "숏팬츠", "레깅스", "코튼", "데님", "기타 하의"],
        "원피스": ["미니원피스", "미디원피스", "맥시원피스"],
        "스커트": ["미니스커트", "미디스커트", "롱스커트"]
    }
}

def mapping2depth_en(depth2category):
    if depth2category == "신발":
        return "shoes"
    elif depth2category == "아우터":
        return "outer"
    elif depth2category == "상의":
        return "top"
    elif depth2category == "하의":
        return "bottom"

def mapping3depth_en(depth3category):
    if depth3category == "전체":
        return "shoes"
    elif depth3category == "재킷":
        return "jacket"
    elif depth3category == "폴리스":
        return "police"
    elif depth3category == "코트":
        return "coat"
    elif depth3category == "패딩":
        return "padding"
    elif depth3category == "기타":
        return "etcouter"
    elif depth3category == "티셔츠":
        return "tshirt"
    elif depth3category == "셔츠":
        return "shirt"
    elif depth3category == "니트":
        return "knit"
    elif depth3category == "팬츠":
        return "pants"
    elif depth3category == "원피스":
        return "onepiece"
